# CreateSurfacefromCurvesNetwork

## Description
This function will create a NURBS surface from a network of selected intersecting curves in the document

```pascal
FUNCTION CreateSurfacefromCurvesNetwork : BOOLEAN;
```

```python

def vs.CreateSurfacefromCurvesNetwork():
    return BOOLEAN
```

## Version
Availability: from VectorWorks10.0
## Category
* Objects - NURBS